# a, b = float(input()), float(input())
# c = 0.5
# s = c * a * b                                                                     # float это как int, но только для дробных чисел
# print(s)
# _____________________________________________

# s, v1, v2 = float(input()), float(input()), float(input())
# x = s / (v1 + v2)
# print(x)
# ______________________________________________

# x = float(input())
# if x != 0:
#     print(1 / x)
# else:
#     print('Обратного числа не существует')
# ______________________________________________

# x = float(input())
# y = 5 / 9 * (x - 32)
# print(y)

# ______________________________________________

# n = int(input())
# if n == 1:
#     print(n * 10.5)
# elif n == 2:                                       # Возраст кота в человеческих годах.
#     print(n * 10.5)
# elif 3 <= n <= 19:
#     print(21 + (n - 2) * 4)
# ______________________________________________

# num = float(input())
# a = num * 10
# a = int(a)
# c = a % 10
# print(c)
# ______________________________________________

# a = float(input())
# b = ((a * 100) % 100) / 100
# print(b)

# или 

# a = float(input())
# print(a - int(a))

# _____________________________________________

# a, b, c, d, e = int(input()), int(input()), int(input()), int(input()), int(input())
# print('Наименьшее число =', min(a, b, c, d, e))                                                 # min выделяет наименьшее число из последовательности аргуметов
# print('Наибольшее число =', max(a, b, c, d, e))                                                 # max выделяет наибольшее число из последовательности аргуметов

# _____________________________________________

# a, b, c = int(input()), int(input()), int(input())
# x = max(a, b, c)
# y = min(a, b, c)
# z = (a + b + c) - (x + y)
# print(x, z, y, sep='\n')

# ____________________________________________

# interesting = int(input())
# a = interesting // 100
# b = (interesting % 100) // 10
# c = interesting % 10
# x = max(a, b, c)
# y = min(a, b, c)
# z = (a + b + c) - (x + y)
# if x - y == z:
#     print('Число интересное')
# else:
#     print('Число неинтересное')

# ____________________________________________

# a, b, c, d, e = float(input()), float(input()), float(input()), float(input()), float(input())
# q = abs(a)
# w = abs(b)
# r = abs(c)                                                                                 # abs это функция числа по модулю (всегда +)
# t = abs(d)                                                                   
# y = abs(e)
# print(q + w + r + t + y)
# ___________________________________________

# p1, p2, q1, q2 = int(input()), int(input()), int(input()), int(input())
# x = abs(p1 - q1) + abs(p2 - q2)                                                                         
# print(x)
# ______________________________________________

# a = '"Python is a great language!",'
# b = 'said Fred.'
# c = '"I'
# d = "don't"
# e = 'ever remember having this much fun before."'  
# print(a, b, c, d, e)
# _________________________________________________________________

# name, secondName = input(), input()
# print('Hello', name, secondName + '!', 'You just delved into Python')
# ______________________________________________________________________

# el_classico = input()
# dlina = len(el_classico)
# print('Футбольная команда', el_classico, 'имеет длину', dlina, 'символов') 
# ____________________________________________________________________________

# town_1, town_2, town_3 = input(), input(), input()
# a = len(town_1)
# b = len(town_2)                                                                      # len считает количество символов в строке
# c = len(town_3)
# x = min(a, b, c)
# y = max(a, b, c)
# if min(a, b, c) == a:
#     print(town_1)
# elif min(a, b, c) == b:
#     print(town_2)
# elif min(a, b, c) == c:
#     print(town_3)
# if max(a, b, c) == a:
#     print(town_1)
# elif max(a, b, c) == b:
#     print(town_2)
# elif max(a, b, c) == c:
#     print(town_3)
# ___________________________________________________________________________

# a, b, c = input(), input(), input()
# x = len(a)
# y = len(b)
# z = len(c)
# if x - y == z - x or y - x == z - y or x - z == z - y or x - y == y - z:
#     print('YES')
# else:
#     print('NO')
# ____________________________________________________________________________

# a = input()
# if 'синий' in a:                                         # оператор in проверяет есть ли в переменной заданные нами символы для проверки
#     print('YES')
# else:
#     print('NO')

# ____________________________________________________________________________

# a = input()
# if 'суббота' in a or 'воскресенье' in a:
#     print('YES')
# else:
#     print('NO')
# ____________________________________________________________________________

# a = input()
# if '@' in a and '.' in a:
#     print('YES')
# else:
#     print('NO')

# ____________________________________________________________________________













# Модули

# Как уже говорилось, одним из преимуществ языка Python является множество разнообразных функций, которые уже реализованы и готовы к использованию. Такие функции упакованы в модули. В Python модулем называется библиотека функций, которую можно подключать к своим программам.
# Модуль math

# Модуль math – один из наиважнейших в Python. Этот модуль предоставляет обширный функционал для проведения вычислений с вещественными числами (числами с плавающей точкой).

# Для использования этих функций в начале программы необходимо подключить модуль, что делается командой import:

# Соответствующий программный код, решающий задачи выглядит так:

# import math

# num1 = math.sqrt(2)     # вычисление корня квадратного из двух
# num2 = math.ceil(3.8)   # округление числа вверх
# num3 = math.floor(3.8)  # округление числа вниз

# print(num1)
# print(num2)
# print(num3)

# и выводит:

# 1.4142135623730951
# 4
# 3


# Особенности подключения модулей

# Как можно заметить из примера выше, для вызова функции мы вынуждены указывать название модуля и символ точки. С другой стороны, если функции используются достаточно часто, то такой вызов (постоянное указание названия модуля и символа точки) может усложнить программу и сделать её менее читабельной. Для того, чтобы не указывать название модуля и символ точки при вызове функций, мы пишем следующий код:

# from math import *

# num1 = sqrt(2)     # вычисление корня квадратного из двух
# num2 = ceil(3.8)   # округление числа вверх
# num3 = floor(3.8)  # округление числа вниз

# print(num1)
# print(num2)
# print(num3)

# Таким образом, подключение модуля следующим образом:

# from math import *

# позволяет не писать название модуля и символ точки. При таком способе подключения, импортируются абсолютно все функции модуля math.

# Если нужно использовать только некоторые функции модуля, то мы можем импортировать только их следующим образом:

# from math import sqrt, ceil

# Теперь мы можем вызывать функции sqrt() и ceil() без префикса math., однако мы не можем вызвать функцию floor(), так как она не подключена:

# from math import sqrt, ceil

# print(sqrt(25))
# print(ceil(34.7))

# print(floor(12.8))  # приведет к ошибке, так как функция floor не подключена



# ________________________________________________________________________________________
# from math import sqrt, pow

# x1, y1, x2, y2 = float(input()), float(input()), float(input()), float(input())
# num = sqrt(pow((x1 - x2), 2) + pow((y1 - y2), 2))
# print(num)
# ______________________________________________________________________________________



# import math

# R = float(input())
# S = math.pi * R**2
# C = 2 * math.pi * R
# print(S)
# print(C)

# _______________________________________________

# from math import *

# a, b = float(input()), float(input())
# print((a + b) / 2)
# print(sqrt(a * b))
# print(2 * a * b / (a + b))
# print(sqrt((pow(a, 2) + pow(b, 2)) / 2))
# _______________________________________________

# from math import *

# radiuna = float(input())
# radiuna_2 = radiuna * pi / 180
# trigunometrya = sin(radiuna_2) + cos(radiuna_2) + tan(radiuna_2) * tan(radiuna_2)
# print(trigunometrya)

# ________________________________________________________________________________________

# from math import *

# num = float(input())
# print(ceil(num) + floor(num))
# ______________________________________________________________________________________

# from math import *

# a, b, c = float(input()), float(input()), float(input())
# D = pow(b, 2) - 4 * a * c
# if D > 0:
#     z1 = (-b - sqrt(D)) / (2 * a)
#     z2 = (-b + sqrt(D)) / (2 * a)
#     print(min(z1, z2))
#     print(max(z1, z2))
# elif D == 0:
#     print(-b / (2 * a))
# elif D < 0:
#     print('Нет корней')
# ______________________________________________________________________________________

# from math import *

# n, a = float(input()), float(input())
# S = (n * pow(a, 2)) / (4 * (tan(pi / n)))
# print(S)
# ______________________________________________________________________________________





