# print('4')
# print('8')
# print('15')
# print('16')
# print('23')
# print('42')

# print('*')
# print('**')
# print('***')
# print('****')
# print('*****')
# print('******')
# print('*******')
# ________________________________

# name = input()
# print('Привет,', name)

# print('Привет,', input())
# ___________________________________

# team = input()
# print(team, '- чемпион!')

# print(input(), '- чемпион!')
# _____________________________________

# print(input())
# print(input())
# print(input())
# ______________________________________

# slark = input()
# pudge = input()
# leo = input()
# print(leo)
# print(pudge)
# print(slark)
# ________________________________________


# print('a', 'b', 'c', sep='*')
# print('d', 'e', 'f', sep='**', end='')
# print('g', 'h', 'i', sep='+', end='%')
# print('j', 'k', 'l', sep='-', end='\n')
# print('m', 'n', 'o', sep='/', end='!')
# print('p', 'q', 'r', sep='1', end='%')    # end (окончание) параметр, который если перевод строки делать не нужно или требуется указать специальное окончание, то следует явно указать значение для параметра
# print('s', 't', 'u', sep='&', end='\n')   # по умолчанию end='\n' , что означает перенос строки на новую.
# print('v', 'w', 'x', sep='%')
# print('y', 'z', sep='/', end='!')
# ________________________________________

# print('I', 'like', 'Python', sep='***')   // sep(сепаратор) параметр, который задает символ разделения, вместо символа пробел
                                            # по умолчанию sep=' ' пробел
# ________________________________________

# a = input()
# b = input()
# c = input()
# d = input()
# print(b, c, d, sep=a) 

# _________________________________________

# print('Привет,', input(), end='!')

# num = 15
# s = str(num)
# print(s)

# _________________________________________

# num = int(input())
# num1 = (num + 1)
# num2 = (num1 + 1)
# print(num)
# print(num1)
# print(num2)

#__________________________________________


# num = (int(input()) + int(input()) + int(input()))
# print(num)

# ______________________________________________

# long = int(input())
# obyem = long * long * long
# ploshad = 6 * long * long
# print('Объем =', obyem)
# print('Площадь полной поверхности =', ploshad)

#_______________________________________________

# x, y = int(input()), int(input())
# z = x + y
# print(3 * (z) * (z) * (z) + 275 * (y) * (y) - 127 * x - 41)

# __________________________________________________________
# a = int(input())
# b = a + 1
# c = a - 1
# print('Следующее за числом', a, 'число:', b)
# print('Для числа', a, 'предыдущее число:', c)
# __________________________________________________________

# print((int(input()) + int(input()) + int(input()) + int(input())) * 3)
# _________________________________________________________________________

# a, b = int(input()), int(input())
# print(str(a), '+', str(b), '=', a + b)                                             # str() (в переводе string - строка) преобразовывает целый тип данных (число в строку)
# print(str(a), '-', str(b), '=', a - b)
# print(str(a), '*', str(b), '=', a * b)

# _______________________________________________________________

# print(int(input()) + int(input()) * (int(input()) - 1))                            # int() (в переводе integer - целое число) преобразовывает строковый тип данных в целочисленный (число)
                                                                                    # input() изначально подразумевает строковый тип, поэтому если мы хотим записать input как число нам нужно обернуть его в int()
# _________________________________________________________

# x = int(input())
# print(x, x * 2, x * 3, x * 4, x * 5, sep='---')

# _________________________________________________________

# print(int(input()) * int(input()) ** (int(input()) - 1))        #     ** - возведение в степень. 

# _________________________________________________________

# print(int(input()) // 100)                                    #   // целочисленное деление

# _________________________________________________________

# a, b = int(input()), int(input())
# print(b // a)
# print(b % a)                                                   #      % выводит остаток деление с остатком 

# __________________________________________________________

# a = int(input())
# print(a // 2 + a % 2)

# _________________________________________________________

# a = int(input())
# print((a + 3) // 4)

# place = int(input())
# cupe = -place // 4
# print(cupe * -1)

# _____________________________________________________________

# a = int(input())
# b = a // 60
# c = a % 60
# print(a, 'мин - это', b, 'час', c, 'минут.')

#___________________________________________________________

# num = int(input())
# last_digit = num % 10
# first_digit = num // 10
# print('Искомое число =', last_digit * 10 + first_digit)

# __________________________________________________________

# a = int(input())
# b = a % 10
# c = (a % 100) // 10
# d = a // 100
# print('Сумма цифр =', b + c + d)
# print('Произведение цифр =', b * c * d )

# ___________________________________________________

# a = int(input())
# b = a % 10                # 3
# c = (a % 100) // 10       # 2
# d = a // 100              # 1
# print(a)
# print( d, b, c, sep='')
# print(c, d, b, sep='')
# print(c, b, d, sep='')
# print(b, d, c, sep='')
# print(b, c, d, sep='')

# _____________________________________________________

# a = int(input())
# b = a // 1000       # 3
# c = a % 10          # 1
# d = (a // 100) % 10 # 2
# f = (a % 100) // 10 # 8
# print('Цифра в позиции тысяч равна', b)
# print('Цифра в позиции сотен равна', d)
# print('Цифра в позиции десятков равна', f)
# print('Цифра в позиции единиц равна', c)

#_____________________________________________________

# print('****************')
# print('*', '*', sep='              ')
# print('*', '*', sep='              ')
# print('****************')

#___________________________________________________

# a = int(input())
# b = int(input())
# print('Квадрат суммы', a, 'и', b, 'равен', (a + b)**2) 
# print('Сумма квадратов', a, 'и', b, 'равна', a**2 + b**2)

#___________________________________________________

# a, b, c, d = int(input()), int(input()), int(input()), int(input())
# print(a ** b + c ** d)

#_________________________________________________________

# n = int(input())
# a = n * 10 + n
# b = n * 100 + a
# print(n + a + b)



# n + nn + nnn = n + 10n + n + 100n + 10n + n = 123n

# n = int(input())
# print(n * 123)
# #_______________________________________________________








